Labs/5_lab/lab_5.tex
% Created 2020-12-10 gio 10:06
% Intended LaTeX compiler: pdflatex
\documentclass{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage[sfdefault]{cabin}
\usepackage[T1]{fontenc}
\usepackage[margin=1in]{geometry}
\author{Matteo Orlando}
\date{}
\title{Programming for Iot - Lab 5}
\hypersetup{
 pdfauthor={Matteo Orlando},
 pdftitle={Programming for Iot - Lab 5},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 26.3 (Org mode 9.4)}, 
 pdflang={English}}
\begin{document}

\maketitle


\section{Exercise 1}
\label{sec:orgfde38f2}
Develop a RESTful style Catalog of a distributed platform for general purpose services. Identify the most suitable HTTP methods (among GET, POST, PUT and DELETE) and develop the web services to:

\begin{enumerate}
\item Retrieve information about IP address and port of the message broker
in the platform

\item Add a new device with the following information

\begin{itemize}
\item unique deviceID

\item end-points (i.e. Rest Web Services and/or MQTT topics)

\item available resources (e.g. Temperature, Humidity and Motion sensor)

\item “insert-timestamp” when this device was added
\end{itemize}
\end{enumerate}

\begin{quote}
(\textbf{SUGGESTION:} to avoid synchronization issues, this attribute is
managed and updated only by the Catalog according to its system clock)
\end{quote}

\begin{enumerate}
\item Update the information of a device

\item Retrieve all the registered devices

\item Retrieve a specific device with a deviceID

\item Register a new user with the following information

\begin{itemize}
\item unique userID

\item name

\item surname

\item email address(es)
\end{itemize}

\item Retrieve all the registered users

\item Retrieve a specific user with a certain userID
\end{enumerate}

\begin{quote}
\textbf{This information is stored in a JSON file and all the information
among the actors in the platform must be exchanged in JSON}

Implement an additional feature of the Catalog to remove all the
devices with “insert-timestamp” higher than two minutes. The Catalog
has to take this action periodically (for example every 1 minute).
\end{quote}

\section{Exercise 2}
\label{sec:orge3d413d}
Develop or modify a temperature sensor simulator and a led simulator to invoke the RESTful Catalog developed in \emph{Exercise\textsubscript{1}}. These devices have to  to periodically (for example every 1 minute) either registers as new devices or refresh the old registration by updating theirs “insert-timestamp”. During the refresh of an old device registration, the Catalog has to update also the “insert-timestamp”.

\section{Exercise 3}
\label{sec:org60240aa}
Develop a control application to monitor if the temperature values, coming from a sensor like the one used in the exercise before, is above or below a given threshold. In case the temperature value is outside the given threshold the application will store these values somewhere. When this application starts, it has to connect to the catalog in order to obtain all the MQTT topic related to the temperatures sensors and subrscibe to those topics.

\section{Exercise 4}
\label{sec:orgd170162}

Using the application developed in all the exercise before try to deploy a simple simulation like the one described below

\begin{quote}
You have developed a system that allows your clients to monitor the temperature in their houses and to switch on and off the light. In your system there are 2 houses with one user each. Each one of this houses has a led and a temperature sensor. In your system there is also a controll application to logs for each user the temperature values outside a common threshold. Each user must be able to obtain his own log of the temperatures and must be able to see and set the status of his light.
\end{quote}

\subsection{Bonus improvements}
\label{sec:orgd3017bd}
\begin{itemize}
\item each user has it's own custom treshold for the temperatures
\item each user has more than one temperature sensor and light
\end{itemize}
\end{document}
